fduignan/stm32f030/include/STM32F0x0.h
typedef struct {                                /*!< (@ 0x40021000) RCC Structure                                              */
  __IOM uint32_t  CR;                           /*!< (@ 0x00000000) Clock control register                                     */
  __IOM uint32_t  CFGR;                         /*!< (@ 0x00000004) Clock configuration register (RCC_CFGR)                    */
  __IOM uint32_t  CIR;                          /*!< (@ 0x00000008) Clock interrupt register (RCC_CIR)                         */
  __IOM uint32_t  APB2RSTR;                     /*!< (@ 0x0000000C) APB2 peripheral reset register (RCC_APB2RSTR)              */
  __IOM uint32_t  APB1RSTR;                     /*!< (@ 0x00000010) APB1 peripheral reset register (RCC_APB1RSTR)              */
  __IOM uint32_t  AHBENR;                       /*!< (@ 0x00000014) AHB Peripheral Clock enable register (RCC_AHBENR)          */
  __IOM uint32_t  APB2ENR;                      /*!< (@ 0x00000018) APB2 peripheral clock enable register (RCC_APB2ENR)        */
  __IOM uint32_t  APB1ENR;                      /*!< (@ 0x0000001C) APB1 peripheral clock enable register (RCC_APB1ENR)        */
  __IOM uint32_t  BDCR;                         /*!< (@ 0x00000020) Backup domain control register (RCC_BDCR)                  */
  __IOM uint32_t  CSR;                          /*!< (@ 0x00000024) Control/status register (RCC_CSR)                          */
  __IOM uint32_t  AHBRSTR;                      /*!< (@ 0x00000028) AHB peripheral reset register                              */
  __IOM uint32_t  CFGR2;                        /*!< (@ 0x0000002C) Clock configuration register 2                             */
  __IOM uint32_t  CFGR3;                        /*!< (@ 0x00000030) Clock configuration register 3                             */
  __IOM uint32_t  CR2;                          /*!< (@ 0x00000034) Clock control register 2                                   */
} RCC_Type;                                     /*!< Size = 56 (0x38)                                                          */



/* =========================================================================================================================== */
/* ================                                          SYSCFG                                           ================ */
/* =========================================================================================================================== */


/**
  * @brief System configuration controller (SYSCFG)
  */

typedef struct {                                /*!< (@ 0x40010000) SYSCFG Structure                                           */
  __IOM uint32_t  CFGR1;                        /*!< (@ 0x00000000) configuration register 1                                   */
  __IM  uint32_t  RESERVED;
  __IOM uint32_t  EXTICR1;                      /*!< (@ 0x00000008) external interrupt configuration register 1                */
  __IOM uint32_t  EXTICR2;                      /*!< (@ 0x0000000C) external interrupt configuration register 2                */
  __IOM uint32_t  EXTICR3;                      /*!< (@ 0x00000010) external interrupt configuration register 3                */
  __IOM uint32_t  EXTICR4;                      /*!< (@ 0x00000014) external interrupt configuration register 4                */
  __IOM uint32_t  CFGR2;                        /*!< (@ 0x00000018) configuration register 2                                   */
} SYSCFG_Type;                                  /*!< Size = 28 (0x1c)                                                          */



/* =========================================================================================================================== */
/* ================                                            ADC                                            ================ */
/* =========================================================================================================================== */


/**
  * @brief Analog-to-digital converter (ADC)
  */

typedef struct {                                /*!< (@ 0x40012400) ADC Structure                                              */
  __IOM uint32_t  ISR;                          /*!< (@ 0x00000000) interrupt and status register                              */
  __IOM uint32_t  IER;                          /*!< (@ 0x00000004) interrupt enable register                                  */
  __IOM uint32_t  CR;                           /*!< (@ 0x00000008) control register                                           */
  __IOM uint32_t  CFGR1;                        /*!< (@ 0x0000000C) configuration register 1                                   */
  __IOM uint32_t  CFGR2;                        /*!< (@ 0x00000010) configuration register 2                                   */
  __IOM uint32_t  SMPR;                         /*!< (@ 0x00000014) sampling time register                                     */
  __IM  uint32_t  RESERVED[2];
  __IOM uint32_t  TR;                           /*!< (@ 0x00000020) watchdog threshold register                                */
  __IM  uint32_t  RESERVED1;
  __IOM uint32_t  CHSELR;                       /*!< (@ 0x00000028) channel selection register                                 */
  __IM  uint32_t  RESERVED2[5];
  __IM  uint32_t  DR;                           /*!< (@ 0x00000040) data register                                              */
  __IM  uint32_t  RESERVED3[177];
  __IOM uint32_t  CCR;                          /*!< (@ 0x00000308) common configuration register                              */
} ADC_Type;                                     /*!< Size = 780 (0x30c)                                                        */



/* =========================================================================================================================== */
/* ================                                          USART1                                           ================ */
/* =========================================================================================================================== */


/**
  * @brief Universal synchronous asynchronous receiver  transmitter (USART1)
  */

typedef struct {                                /*!< (@ 0x40013800) USART1 Structure                                           */
  __IOM uint32_t  CR1;                          /*!< (@ 0x00000000) Control register 1                                         */
  __IOM uint32_t  CR2;                          /*!< (@ 0x00000004) Control register 2                                         */
  __IOM uint32_t  CR3;                          /*!< (@ 0x00000008) Control register 3                                         */
  __IOM uint32_t  BRR;                          /*!< (@ 0x0000000C) Baud rate register                                         */
  __IOM uint32_t  GTPR;                         /*!< (@ 0x00000010) Guard time and prescaler register                          */
  __IOM uint32_t  RTOR;                         /*!< (@ 0x00000014) Receiver timeout register                                  */
  __IOM uint32_t  RQR;                          /*!< (@ 0x00000018) Request register                                           */
  __IM  uint32_t  ISR;                          /*!< (@ 0x0000001C) Interrupt & status register                                */
  __IOM uint32_t  ICR;                          /*!< (@ 0x00000020) Interrupt flag clear register                              */
  __IM  uint32_t  RDR;                          /*!< (@ 0x00000024) Receive data register                                      */
  __IOM uint32_t  TDR;                          /*!< (@ 0x00000028) Transmit data register                                     */
} USART1_Type;                                  /*!< Size = 44 (0x2c)                                                          */



/* =========================================================================================================================== */
/* ================                                            RTC                                            ================ */
/* =========================================================================================================================== */


/**
  * @brief Real-time clock (RTC)
  */

typedef struct {                                /*!< (@ 0x40002800) RTC Structure                                              */
  __IOM uint32_t  TR;                           /*!< (@ 0x00000000) time register                                              */
  __IOM uint32_t  DR;                           /*!< (@ 0x00000004) date register                                              */
  __IOM uint32_t  CR;                           /*!< (@ 0x00000008) control register                                           */
  __IOM uint32_t  ISR;                          /*!< (@ 0x0000000C) initialization and status register                         */
  __IOM uint32_t  PRER;                         /*!< (@ 0x00000010) prescaler register                                         */
  __IM  uint32_t  RESERVED[2];
  __IOM uint32_t  ALRMAR;                       /*!< (@ 0x0000001C) alarm A register                                           */
  __IM  uint32_t  RESERVED1;
  __OM  uint32_t  WPR;                          /*!< (@ 0x00000024) write protection register                                  */
  __IM  uint32_t  SSR;                          /*!< (@ 0x00000028) sub second register                                        */
  __OM  uint32_t  SHIFTR;                       /*!< (@ 0x0000002C) shift control register                                     */
  __IM  uint32_t  TSTR;                         /*!< (@ 0x00000030) timestamp time register                                    */
  __IM  uint32_t  TSDR;                         /*!< (@ 0x00000034) timestamp date register                                    */
  __IM  uint32_t  TSSSR;                        /*!< (@ 0x00000038) time-stamp sub second register                             */
  __IOM uint32_t  CALR;                         /*!< (@ 0x0000003C) calibration register                                       */
  __IOM uint32_t  TAFCR;                        /*!< (@ 0x00000040) tamper and alternate function configuration register       */
  __IOM uint32_t  ALRMASSR;                     /*!< (@ 0x00000044) alarm A sub second register                                */
  __IM  uint32_t  RESERVED2[2];
  __IOM uint32_t  BKP0R;                        /*!< (@ 0x00000050) backup register                                            */
  __IOM uint32_t  BKP1R;                        /*!< (@ 0x00000054) backup register                                            */
  __IOM uint32_t  BKP2R;                        /*!< (@ 0x00000058) backup register                                            */
  __IOM uint32_t  BKP3R;                        /*!< (@ 0x0000005C) backup register                                            */
  __IOM uint32_t  BKP4R;                        /*!< (@ 0x00000060) backup register                                            */
} RTC_Type;                                     /*!< Size = 100 (0x64)                                                         */



/* =========================================================================================================================== */
/* ================                                           TIM15                                           ================ */
/* =========================================================================================================================== */


/**
  * @brief General-purpose-timers (TIM15)
  */

typedef struct {                                /*!< (@ 0x40014000) TIM15 Structure                                            */
  __IOM uint32_t  CR1;                          /*!< (@ 0x00000000) control register 1                                         */
  __IOM uint32_t  CR2;                          /*!< (@ 0x00000004) control register 2                                         */
  __IOM uint32_t  SMCR;                         /*!< (@ 0x00000008) slave mode control register                                */
  __IOM uint32_t  DIER;                         /*!< (@ 0x0000000C) DMA/Interrupt enable register                              */
  __IOM uint32_t  SR;                           /*!< (@ 0x00000010) status register                                            */
  __OM  uint32_t  EGR;                          /*!< (@ 0x00000014) event generation register                                  */
  
  union {
    __IOM uint32_t CCMR1_Output;                /*!< (@ 0x00000018) capture/compare mode register (output mode)                */
    __IOM uint32_t CCMR1_Input;                 /*!< (@ 0x00000018) capture/compare mode register 1 (input mode)               */
  };
  __IM  uint32_t  RESERVED;
  __IOM uint32_t  CCER;                         /*!< (@ 0x00000020) capture/compare enable register                            */
  __IOM uint32_t  CNT;                          /*!< (@ 0x00000024) counter                                                    */
  __IOM uint32_t  PSC;                          /*!< (@ 0x00000028) prescaler                                                  */
  __IOM uint32_t  ARR;                          /*!< (@ 0x0000002C) auto-reload register                                       */
  __IOM uint32_t  RCR;                          /*!< (@ 0x00000030) repetition counter register                                */
  __IOM uint32_t  CCR1;                         /*!< (@ 0x00000034) capture/compare register 1                                 */
  __IOM uint32_t  CCR2;                         /*!< (@ 0x00000038) capture/compare register 2                                 */
  __IM  uint32_t  RESERVED1[2];
  __IOM uint32_t  BDTR;                         /*!< (@ 0x00000044) break and dead-time register                               */
  __IOM uint32_t  DCR;                          /*!< (@ 0x00000048) DMA control register                                       */
  __IOM uint32_t  DMAR;                         /*!< (@ 0x0000004C) DMA address for full transfer                              */
} TIM15_Type;                                   /*!< Size = 80 (0x50)                                                          */



/* =========================================================================================================================== */
/* ================                                           TIM16                                           ================ */
/* =========================================================================================================================== */


/**
  * @brief General-purpose-timers (TIM16)
  */

typedef struct {                                /*!< (@ 0x40014400) TIM16 Structure                                            */
  __IOM uint32_t  CR1;                          /*!< (@ 0x00000000) control register 1                                         */
  __IOM uint32_t  CR2;                          /*!< (@ 0x00000004) control register 2                                         */
  __IM  uint32_t  RESERVED;
  __IOM uint32_t  DIER;                         /*!< (@ 0x0000000C) DMA/Interrupt enable register                              */
  __IOM uint32_t  SR;                           /*!< (@ 0x00000010) status register                                            */
  __OM  uint32_t  EGR;                          /*!< (@ 0x00000014) event generation register                                  */
  
  union {
    __IOM uint32_t CCMR1_Output;                /*!< (@ 0x00000018) capture/compare mode register (output mode)                */
    __IOM uint32_t CCMR1_Input;                 /*!< (@ 0x00000018) capture/compare mode register 1 (input mode)               */
  };
  __IM  uint32_t  RESERVED1;
  __IOM uint32_t  CCER;                         /*!< (@ 0x00000020) capture/compare enable register                            */
  __IOM uint32_t  CNT;                          /*!< (@ 0x00000024) counter                                                    */
  __IOM uint32_t  PSC;                          /*!< (@ 0x00000028) prescaler                                                  */
  __IOM uint32_t  ARR;                          /*!< (@ 0x0000002C) auto-reload register                                       */
  __IOM uint32_t  RCR;                          /*!< (@ 0x00000030) repetition counter register                                */
  __IOM uint32_t  CCR1;                         /*!< (@ 0x00000034) capture/compare register 1                                 */
  __IM  uint32_t  RESERVED2[3];
  __IOM uint32_t  BDTR;                         /*!< (@ 0x00000044) break and dead-time register                               */
  __IOM uint32_t  DCR;                          /*!< (@ 0x00000048) DMA control register                                       */
  __IOM uint32_t  DMAR;                         /*!< (@ 0x0000004C) DMA address for full transfer                              */
} TIM16_Type;                                   /*!< Size = 80 (0x50)                                                          */



/* =========================================================================================================================== */
/* ================                                           Flash                                           ================ */
/* =========================================================================================================================== */


/**
  * @brief Flash (Flash)
  */

typedef struct {                                /*!< (@ 0x40022000) Flash Structure                                            */
  __IOM uint32_t  ACR;                          /*!< (@ 0x00000000) Flash access control register                              */
  __OM  uint32_t  KEYR;                         /*!< (@ 0x00000004) Flash key register                                         */
  __OM  uint32_t  OPTKEYR;                      /*!< (@ 0x00000008) Flash option key register                                  */
  __IOM uint32_t  SR;                           /*!< (@ 0x0000000C) Flash status register                                      */
  __IOM uint32_t  CR;                           /*!< (@ 0x00000010) Flash control register                                     */
  __OM  uint32_t  AR;                           /*!< (@ 0x00000014) Flash address register                                     */
  __IM  uint32_t  RESERVED;
  __IM  uint32_t  OBR;                          /*!< (@ 0x0000001C) Option byte register                                       */
  __IM  uint32_t  WRPR;                         /*!< (@ 0x00000020) Write protection register                                  */
} Flash_Type;                                   /*!< Size = 36 (0x24)                                                          */



/* =========================================================================================================================== */
/* ================                                          DBGMCU                                           ================ */
/* =========================================================================================================================== */


/**
  * @brief Debug support (DBGMCU)
  */

typedef struct {                                /*!< (@ 0x40015800) DBGMCU Structure                                           */
  __IM  uint32_t  IDCODE;                       /*!< (@ 0x00000000) MCU Device ID Code Register                                */
  __IOM uint32_t  CR;                           /*!< (@ 0x00000004) Debug MCU Configuration Register                           */
  __IOM uint32_t  APB1_FZ;                      /*!< (@ 0x00000008) Debug MCU APB1 freeze register                             */
  __IOM uint32_t  APB2_FZ;                      /*!< (@ 0x0000000C) Debug MCU APB2 freeze register                             */
} DBGMCU_Type;                                  /*!< Size = 16 (0x10)                                                          */



/* =========================================================================================================================== */
/* ================                                            USB                                            ================ */
/* =========================================================================================================================== */


/**
  * @brief Universal serial bus full-speed device  interface (USB)
  */

typedef struct {                                /*!< (@ 0x40005C00) USB Structure                                              */
  __IOM uint32_t  EP0R;                         /*!< (@ 0x00000000) endpoint 0 register                                        */
  __IOM uint32_t  EP1R;                         /*!< (@ 0x00000004) endpoint 1 register                                        */
  __IOM uint32_t  EP2R;                         /*!< (@ 0x00000008) endpoint 2 register                                        */
  __IOM uint32_t  EP3R;                         /*!< (@ 0x0000000C) endpoint 3 register                                        */
  __IOM uint32_t  EP4R;                         /*!< (@ 0x00000010) endpoint 4 register                                        */
  __IOM uint32_t  EP5R;                         /*!< (@ 0x00000014) endpoint 5 register                                        */
  __IOM uint32_t  EP6R;                         /*!< (@ 0x00000018) endpoint 6 register                                        */
  __IOM uint32_t  EP7R;                         /*!< (@ 0x0000001C) endpoint 7 register                                        */
  __IM  uint32_t  RESERVED[8];
  __IOM uint32_t  CNTR;                         /*!< (@ 0x00000040) control register                                           */
  __IOM uint32_t  ISTR;                         /*!< (@ 0x00000044) interrupt status register                                  */
  __IM  uint32_t  FNR;                          /*!< (@ 0x00000048) frame number register                                      */
  __IOM uint32_t  DADDR;                        /*!< (@ 0x0000004C) device address                                             */
  __IOM uint32_t  BTABLE;                       /*!< (@ 0x00000050) Buffer table address                                       */
  __IOM uint32_t  LPMCSR;                       /*!< (@ 0x00000054) LPM control and status register                            */
  __IOM uint32_t  BCDR;                         /*!< (@ 0x00000058) Battery charging detector                                  */
} USB_Type;                                     /*!< Size = 92 (0x5c)                                                          */



/* =========================================================================================================================== */
/* ================                                            SCB                                            ================ */
/* =========================================================================================================================== */


/**
  * @brief System control block (SCB)
  */

