fduignan/stm32f030/include/STM32F0x0.h
typedef struct {                                /*!< (@ 0xE000ED00) SCB Structure                                              */
  __IM  uint32_t  CPUID;                        /*!< (@ 0x00000000) CPUID base register                                        */
  __IOM uint32_t  ICSR;                         /*!< (@ 0x00000004) Interrupt control and state register                       */
  __IM  uint32_t  RESERVED;
  __IOM uint32_t  AIRCR;                        /*!< (@ 0x0000000C) Application interrupt and reset control register           */
  __IOM uint32_t  SCR;                          /*!< (@ 0x00000010) System control register                                    */
  __IOM uint32_t  CCR;                          /*!< (@ 0x00000014) Configuration and control register                         */
  __IM  uint32_t  RESERVED1;
  __IOM uint32_t  SHPR2;                        /*!< (@ 0x0000001C) System handler priority registers                          */
  __IOM uint32_t  SHPR3;                        /*!< (@ 0x00000020) System handler priority registers                          */
} SCB_Type;                                     /*!< Size = 36 (0x24)                                                          */



/* =========================================================================================================================== */
/* ================                                            STK                                            ================ */
/* =========================================================================================================================== */


/**
  * @brief SysTick timer (STK)
  */

typedef struct {                                /*!< (@ 0xE000E010) STK Structure                                              */
  __IOM uint32_t  CSR;                          /*!< (@ 0x00000000) SysTick control and status register                        */
  __IOM uint32_t  RVR;                          /*!< (@ 0x00000004) SysTick reload value register                              */
  __IOM uint32_t  CVR;                          /*!< (@ 0x00000008) SysTick current value register                             */
  __IOM uint32_t  CALIB;                        /*!< (@ 0x0000000C) SysTick calibration value register                         */
} STK_Type;                                     /*!< Size = 16 (0x10)                                                          */


/** @} */ /* End of group Device_Peripheral_peripherals */


/* =========================================================================================================================== */
/* ================                          Device Specific Peripheral Address Map                           ================ */
/* =========================================================================================================================== */


/** @addtogroup Device_Peripheral_peripheralAddr
  * @{
  */

#define CRC_BASE                    0x40023000UL
#define GPIOF_BASE                  0x48001400UL
#define GPIOD_BASE                  0x48000C00UL
#define GPIOC_BASE                  0x48000800UL
#define GPIOB_BASE                  0x48000400UL
#define GPIOA_BASE                  0x48000000UL
#define SPI1_BASE                   0x40013000UL
#define SPI2_BASE                   0x40003800UL
#define PWR_BASE                    0x40007000UL
#define I2C1_BASE                   0x40005400UL
#define I2C2_BASE                   0x40005800UL
#define IWDG_BASE                   0x40003000UL
#define WWDG_BASE                   0x40002C00UL
#define TIM1_BASE                   0x40012C00UL
#define TIM3_BASE                   0x40000400UL
#define TIM14_BASE                  0x40002000UL
#define TIM6_BASE                   0x40001000UL
#define TIM7_BASE                   0x40001400UL
#define EXTI_BASE                   0x40010400UL
#define NVIC_BASE                   0xE000E100UL
#define DMA1_BASE                   0x40020000UL
#define RCC_BASE                    0x40021000UL
#define SYSCFG_BASE                 0x40010000UL
#define ADC_BASE                    0x40012400UL
#define USART1_BASE                 0x40013800UL
#define USART2_BASE                 0x40004400UL
#define USART3_BASE                 0x40004800UL
#define USART4_BASE                 0x40004C00UL
#define USART6_BASE                 0x40011400UL
#define USART5_BASE                 0x40005000UL
#define RTC_BASE                    0x40002800UL
#define TIM15_BASE                  0x40014000UL
#define TIM16_BASE                  0x40014400UL
#define TIM17_BASE                  0x40014800UL
#define Flash_BASE                  0x40022000UL
#define DBGMCU_BASE                 0x40015800UL
#define USB_BASE                    0x40005C00UL
#define SCB_BASE                    0xE000ED00UL
#define STK_BASE                    0xE000E010UL

/** @} */ /* End of group Device_Peripheral_peripheralAddr */


/* =========================================================================================================================== */
/* ================                                  Peripheral declaration                                   ================ */
/* =========================================================================================================================== */


/** @addtogroup Device_Peripheral_declaration
  * @{
  */

#define CRC                         ((CRC_Type*)               CRC_BASE)
#define GPIOF                       ((GPIOF_Type*)             GPIOF_BASE)
#define GPIOD                       ((GPIOF_Type*)             GPIOD_BASE)
#define GPIOC                       ((GPIOF_Type*)             GPIOC_BASE)
#define GPIOB                       ((GPIOF_Type*)             GPIOB_BASE)
#define GPIOA                       ((GPIOA_Type*)             GPIOA_BASE)
#define SPI1                        ((SPI1_Type*)              SPI1_BASE)
#define SPI2                        ((SPI1_Type*)              SPI2_BASE)
#define PWR                         ((PWR_Type*)               PWR_BASE)
#define I2C1                        ((I2C1_Type*)              I2C1_BASE)
#define I2C2                        ((I2C1_Type*)              I2C2_BASE)
#define IWDG                        ((IWDG_Type*)              IWDG_BASE)
#define WWDG                        ((WWDG_Type*)              WWDG_BASE)
#define TIM1                        ((TIM1_Type*)              TIM1_BASE)
#define TIM3                        ((TIM3_Type*)              TIM3_BASE)
#define TIM14                       ((TIM14_Type*)             TIM14_BASE)
#define TIM6                        ((TIM6_Type*)              TIM6_BASE)
#define TIM7                        ((TIM6_Type*)              TIM7_BASE)
#define EXTI                        ((EXTI_Type*)              EXTI_BASE)
#define NVIC                        ((NVIC_Type*)              NVIC_BASE)
#define DMA1                        ((DMA1_Type*)              DMA1_BASE)
#define RCC                         ((RCC_Type*)               RCC_BASE)
#define SYSCFG                      ((SYSCFG_Type*)            SYSCFG_BASE)
#define ADC                         ((ADC_Type*)               ADC_BASE)
#define USART1                      ((USART1_Type*)            USART1_BASE)
#define USART2                      ((USART1_Type*)            USART2_BASE)
#define USART3                      ((USART1_Type*)            USART3_BASE)
#define USART4                      ((USART1_Type*)            USART4_BASE)
#define USART6                      ((USART1_Type*)            USART6_BASE)
#define USART5                      ((USART1_Type*)            USART5_BASE)
#define RTC                         ((RTC_Type*)               RTC_BASE)
#define TIM15                       ((TIM15_Type*)             TIM15_BASE)
#define TIM16                       ((TIM16_Type*)             TIM16_BASE)
#define TIM17                       ((TIM16_Type*)             TIM17_BASE)
#define Flash                       ((Flash_Type*)             Flash_BASE)
#define DBGMCU                      ((DBGMCU_Type*)            DBGMCU_BASE)
#define USB                         ((USB_Type*)               USB_BASE)
#define SCB                         ((SCB_Type*)               SCB_BASE)
#define STK                         ((STK_Type*)               STK_BASE)

/** @} */ /* End of group Device_Peripheral_declaration */


/* =========================================  End of section using anonymous unions  ========================================= */
#if defined (__CC_ARM)
  #pragma pop
#elif defined (__ICCARM__)
  /* leave anonymous unions enabled */
#elif (__ARMCC_VERSION >= 6010050)
  #pragma clang diagnostic pop
#elif defined (__GNUC__)
  /* anonymous unions are enabled by default */
#elif defined (__TMS470__)
  /* anonymous unions are enabled by default */
#elif defined (__TASKING__)
  #pragma warning restore
#elif defined (__CSMC__)
  /* anonymous unions are enabled by default */
#endif


#ifdef __cplusplus
}
#endif

#endif /* STM32F0X0_H */


/** @} */ /* End of group STM32F0x0 */

/** @} */ /* End of group  */
